Reverendissimo/ESP32-Voice/firmware/sdkconfig.defaults
# ESP32-S3-BOX-3 target defaults (see esp-box examples)

CONFIG_IDF_TARGET="esp32s3"

# Flash (16MB Quad on BOX-3 module)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Octal PSRAM (required on BOX-3 — flash/PSRAM share MSPI bus)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Cache (BOX-3 / octal PSRAM)
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Partition
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
